package 一_基础算法.a3_二分;

/**
 * @user: Hasee
 * @date: 2021/2/10 23:27
 * @author: 1931559710@qq.com
 * ClassName: range_of_number
 * Description:
 * 给定一个按照升序排列的长度为n的整数数组，以及 q 个查询。
 * <p>
 * 对于每个查询，返回一个元素k的起始位置和终止位置（位置从0开始计数）。
 * <p>
 * 如果数组中不存在该元素，则返回“-1 -1”。
 * <p>
 * 输入格式
 * 第一行包含整数n和q，表示数组长度和询问个数。
 * <p>
 * 第二行包含n个整数（均在1~10000范围内），表示完整数组。
 * <p>
 * 接下来q行，每行包含一个整数k，表示一个询问元素。
 * <p>
 * 输出格式
 * 共q行，每行包含两个整数，表示所求元素的起始位置和终止位置。
 * <p>
 * 如果数组中不存在该元素，则返回“-1 -1”。
 * <p>
 * 数据范围
 * 1≤n≤100000
 * 1≤q≤10000
 * 1≤k≤10000
 * 输入样例：
 * 6 3
 * 1 2 2 3 3 4
 * 3
 * 4
 * 5
 * 输出样例：
 * 3 4
 * 5 5
 * -1 -1
 */
public class range_of_number {
    public static void main(String[] args) {

    }
}
